
#include <iostream>
using namespace std;

int main ()
{
    //Begin 29. Швидкість першого автомобіля V1 км / год, другого - V2 км / год, відстань між ними S км.
    //Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один одному.
    //Дана відстань рівна модулю різниці початкової відстані і загального шляху, пройденого автомобілями;
    //загальний шлях = час · сумарна швидкість.
    //декларації
      long v,v1,s,s1,t;
    //введення 
      cin>>v>>v1>>s>>t;
    //обчислення
      s1=(v*t)+(v1*t)+s;
    //виведення  
      cout<<s1;
      system("pause");
      return 0;}